package pers.luochen.objectoriented;

/*
 *                        _oo0oo_
 *                       o8888888o
 *                       88" . "88
 *                       (| -_- |)
 *                       0\  =  /0
 *                     ___/`---'\___
 *                   .' \\|     |// '.
 *                  / \\|||  :  |||// \
 *                 / _||||| -:- |||||- \
 *                |   | \\\  - /// |   |
 *                | \_|  ''\---/''  |_/ |
 *                \  .-\__  '-'  ___/-. /
 *              ___'. .'  /--.--\  `. .'___
 *           ."" '<  `.___\_<|>_/___.' >' "".
 *          | | :  `- \`.;`\ _ /`;.`/ - ` : | |
 *          \  \ `_.   \_ __\ /__ _/   .-` /  /
 *      =====`-.____`.___ \_____/___.-`___.-'=====
 *                        `=---='
 *
 *
 *      ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
 *
 *            佛祖保佑     永不宕机     永无BUG
 */

/**
 * @author: LiZhiHao
 * @Date: 2022-03-27 14:02:43
 * @LastEditTime: 2022-03-27 22:40:38
 */
public class Test05 {

    public static void main(String[] args) {
        Client c = new Client();
        //null
        System.out.println(c.name);
        //c = null;
        //java.lang.NullPointerException，空指针异常
        //空引用访问“实例”相关数据一定会出现空指针异常
        //此时Client对象被垃圾回收，因为没有引用在指向它。
        //编译通过，运行报错。
        System.out.println(c.name);

        //什么是实例相关数据？
        //实例相关数据表示：这个数据访问时必须有对象的参与。这种数据就是实例相关数据
    }
}