package pers.array;

/**
 * @Author LiZiHao
 * @Date 2022/5/15/23:35
 */
public class ArrayTest {
    /*
        1:Java语言中的数组是一种引用数据类型结构,不是基本数据类型.
        2:数组相当于一个容器,可以容纳多个数据(元素),数组是一个数据的集合;
        数组:字面意思:一组数据;
        3:数据中存储的元素可以是"基本数据类型"也可以是"引用数据类型";
        4:数组中的元素是有下标的,通过下标可以查找某个下标上的具体数据,下标是从0开始,以1递增的;
        5:因为数组是引用数据类型,所以数组对象是存储在堆内存中的(数组是存储在堆内存中的);
        6:数组当中存储的是Java对象的话,那么实际上存储的是Java对象的"引用(内存地址)",数组不能直接存储Java对象.
        7:数组中都一个length属性(JAVA自带),用来获取数组中元素的个数;
        8:数组的种类:一维数组,二维数组,三维数组,多维数组.....(一维数组经常使用,二维数组偶尔使用)
        9:数组一旦创建,在JAVA中规定:数组长度不可变.(数组长度不可变);
        10:数组中的元素只能是同类型的,int类型的数组就只能存储int类型的数据,String类型的数组就只能存储String类型的数据.
            例如:苹果购物袋里只能放苹果不能放橘子.
        11:
     */
    public static void main(String[] args) {
    }
}
